0/f
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_1
    {
        type            zeroGradient;
    }
    outlet_1
    {
        type            zeroGradient;
    }

    }
    fixedWalls_1
    {
        type            fWallFunction;
        value           uniform 0;
    }
    frontAndBack_1
    {
        type            empty;
    }

    inlet_2
    {
        type            zeroGradient;
    }
    outlet_2
    {
        type            zeroGradient;
    }

    }
    fixedWalls_2
    {
        type            fWallFunction;
        value           uniform 0;
    }
    frontAndBack_2
    {
        type            empty;
    }

    inlet_3
    {
        type            zeroGradient;
    }
    outlet_3
    {
        type            zeroGradient;
    }

    }
    fixedWalls_3
    {
        type            fWallFunction;
        value           uniform 0;
    }
    frontAndBack_3
    {
        type            empty;
    }

    inlet_4
    {
        type            zeroGradient;
    }
    outlet_4
    {
        type            zeroGradient;
    }

    }
    fixedWalls_4
    {
        type            fWallFunction;
        value           uniform 0;
    }
    frontAndBack_4
    {
        type            empty;
    }

    inlet_5
    {
        type            zeroGradient;
    }
    outlet_5
    {
        type            zeroGradient;
    }

    }
    fixedWalls_5
    {
        type            fWallFunction;
        value           uniform 0;
    }
    frontAndBack_5
    {
        type            empty;
    }
}


// ************************************************************************* //
