constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

20
(
    fixedWalls_1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       19400;
    }
    frontAndBack_1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       19600;
    }
    inlet_1
    {
        type            patch;
        nFaces          20;
        startFace       23600;
    }
    outlet_1
    {
        type            patch;
        nFaces          20;
        startFace       23620;
    }
    fixedWalls_2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       23640;
    }
    frontAndBack_2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       23840;
    }
    inlet_2
    {
        type            patch;
        nFaces          20;
        startFace       27840;
    }
    outlet_2
    {
        type            patch;
        nFaces          20;
        startFace       27860;
    }
    fixedWalls_3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       27880;
    }
    frontAndBack_3
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       28080;
    }
    inlet_3
    {
        type            patch;
        nFaces          20;
        startFace       32080;
    }
    outlet_3
    {
        type            patch;
        nFaces          20;
        startFace       32100;
    }
    fixedWalls_4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       32120;
    }
    frontAndBack_4
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       32320;
    }
    inlet_4
    {
        type            patch;
        nFaces          20;
        startFace       36320;
    }
    outlet_4
    {
        type            patch;
        nFaces          20;
        startFace       36340;
    }
    fixedWalls_5
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       36360;
    }
    frontAndBack_5
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       36560;
    }
    inlet_5
    {
        type            patch;
        nFaces          20;
        startFace       40560;
    }
    outlet_5
    {
        type            patch;
        nFaces          20;
        startFace       40580;
    }
)

// ************************************************************************* //
