system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    // 1 hole
    (0 0 0)
    (5 0 0)
    (5 50 0)
    (0 50 0)
    (0 0 1)
    (5 0 1)
    (5 50 1)
    (0 50 1)

    // 2 hole
    (10 0 0)
    (15 0 0)
    (15 50 0)
    (10 50 0)
    (10 0 1)
    (15 0 1)
    (15 50 1)
    (10 50 1)

    // 3 hole
    (20 0 0)
    (25 0 0)
    (25 50 0)
    (20 50 0)
    (20 0 1)
    (25 0 1)
    (25 50 1)
    (20 50 1)

    // 4 hole
    (30 0 0)
    (35 0 0)
    (35 50 0)
    (30 50 0)
    (30 0 1)
    (35 0 1)
    (35 50 1)
    (30 50 1)

    // 5 hole
    (40 0 0)
    (45 0 0)
    (45 50 0)
    (40 50 0)
    (40 0 1)
    (45 0 1)
    (45 50 1)
    (40 50 1)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7)    (20 100 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15)    (20 100 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23)    (20 100 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31)    (20 100 1) simpleGrading (1 1 1)
    hex (32 33 34 35 36 37 38 39)    (20 100 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(

    fixedWalls_1
    {
        type    wall;
        faces
    (
        (0 4 7 3)
        (2 6 5 1)

    );
    }

    frontAndBack_1
    {
        type    empty;
        faces
    (
        (0 3 2 1)
        (4 5 6 7)
    );
    }

    inlet_1
    {
        type patch;
        faces
    (
        (3 7 6 2)
    );
    }

    outlet_1
    {
        type patch;
        faces
    (
        (1 5 4 0)
    );
    }

    fixedWalls_2
    {
        type    wall;
        faces
    (
        (8 12 15 11)
        (10 14 13 9)
    );
    }

    frontAndBack_2
    {
        type    empty;
        faces
    (
        (8 11 10 9)
        (15 12 13 14)
    );
    }

    inlet_2
    {
        type patch;
        faces
    (
        (11 15 14 10)
    );
    }

    outlet_2
    {
        type patch;
        faces
    (
        (9 13 12 8)
    );
    }

    fixedWalls_3
    {
        type    wall;
        faces
    (
        (20 23 19 16)
        (17 18 22 21)
    );
    }

    frontAndBack_3
    {
        type    empty;
        faces
    (
        (20 21 22 23)
        (16 19 18 17)
    );
    }

    inlet_3
    {
        type patch;
        faces
    (
        (18 19 23 22)
    );
    }

    outlet_3
    {
        type patch;
        faces
    (
        (21 20 16 17)
    );
    }

    fixedWalls_4
    {
        type    wall;
        faces
    (
        (28 31 27 24)
        (25 26 30 29)
    );
    }

    frontAndBack_4
    {
        type    empty;
        faces
    (
        (28 29 30 31)
        (27 26 25 24)
    );
    }

    inlet_4
    {
        type patch;
        faces
    (
        (26 27 31 30)
    );
    }

    outlet_4
    {
        type patch;
        faces
    (
        (24 25 29 28)
    );
    }

    fixedWalls_5
    {
        type    wall;
        faces
    (
        (36 39 35 32)
        (33 34 38 37)
    );
    }

    frontAndBack_5
    {
        type    empty;
        faces
    (
        (36 37 38 39)
        (35 34 33 32)
    );
    }

    inlet_5
    {
        type patch;
        faces
    (
        (39 35 34 38)
    );
    }

    outlet_5
    {
        type patch;
        faces
    (
        (32 33 37 36)
    );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
